{
  "name": "Cloud Load Balancing",
  "entries": {
    "2025-06-26": [
      {
        "kind": "Feature",
        "content": "In typical HTTPS communication, neither the load balancer nor the backend verify each other's identity, assuming that they are within a secure perimeter and can be trusted. However, when perimeter security needs reinforcement or communication extends beyond the perimeter, backend mTLS becomes essential. Backend mTLS ensures secure communication by requiring both the load balancer and the backend to mutually verify their identities.\n\nWith *backend authenticated TLS*, the load balancer verifies the backend server's certificate by checking its chain of trust, thereby confirming the backend's identity. Conversely, with *backend mTLS*, the backend server verifies the client certificate presented by the load balancer. Together, these mechanisms enable backend mTLS, ensuring that both parties validate each other's identity.\n\nBackend mTLS complements frontend mTLS, which is already generally available (GA).\n\nFor details, see the following:\n\n* [Backend mTLS overview](https://cloud.google.com/load-balancing/docs/backend-authenticated-tls-backend-mtls)\n* [Set up backend authenticated TLS](https://cloud.google.com/load-balancing/docs/backend-authenticated-tls-setup)\n* [Set up backend mTLS](https://cloud.google.com/load-balancing/docs/backend-mtls-setup)\n\nThis capability is in **General Availability** for global external Application Load Balancers."
      }
    ],
    "2025-06-13": [
      {
        "kind": "Feature",
        "content": "Cloud Load Balancing supports load balancing to multi-NIC instances that use [Dynamic NICs](https://cloud.google.com/vpc/docs/multiple-interfaces-concepts).\n\nThis capability is in **Preview**."
      }
    ],
    "2025-06-03": [
      {
        "kind": "Feature",
        "content": "Application Load Balancers now support the use of *custom metrics* that let you configure your load balancer's traffic distribution behavior to be based on metrics specific to your application or infrastructure requirements, rather than Google Cloud's standard utilization or rate-based metrics. Defining custom metrics for your load balancer gives you the flexibility to route application requests to the backend instances and endpoints that are most optimal for your workload.\n\nFor more information, see [Custom metrics for Application Load Balancers](https://cloud.google.com/load-balancing/docs/https/applb-custom-metrics).\n\nThis capability is in **General availability**."
      },
      {
        "kind": "Feature",
        "content": "Cleartext HTTP/2 over TCP, also known as H2C, lets you use HTTP/2 without TLS. H2C is supported by internal and external Application Load Balancers for both of the following connections:\n\n* Connections between clients and the load balancer. No special configuration is required. Support for this capability is already in **General Availability**.\n* Connections between the load balancer and its backends. Support for this capability is now in **General Availability**.\n\n  To configure H2C for connections between the load balancer and its backends, you set the backend service protocol to `H2C`."
      }
    ]
  }
}