{
  "name": "Google Cloud Contact Center as a Service",
  "entries": {
    "2025-06-26": [
      {
        "kind": "Announcement",
        "content": "**Web SDK version 3**\n\nWe're pleased to announce that the web SDK v3 is now [generally available (GA)](https://cloud.google.com/products#product-launch-stages). The web SDK v3 is built on the [headless web SDK](https://cloud.google.com/contact-center/ccai-platform/docs/headless-web-guide), so all of the methods that are available on a headless SDK client are also available with the web SDK v3 widget.\n\n**Deprecation notice**\n\nStarting on **December 31, 2025**, the web SDK v2 will no longer function. Be sure to [update your website](https://cloud.google.com/contact-center/ccai-platform/docs/web-sdk-v3-upgrade) to use the web SDK v3 before that date to avoid breaking your integration with the web SDK. We are no longer adding new features to the web SDK v2.\n\n**Capabilities**\n\nThe web SDK v3 provides the following new capabilities:\n\n* **View previous chats and download chat transcripts**. End-users can view previous chats and download chat transcripts from the web SDK widget. For more information, see [View previous chats and download chat transcripts](https://cloud.google.com/contact-center/ccai-platform/docs/chat-transcripts).\n* **Web forms**. You can set up HTML web forms to collect data from end-users. For more information, see [Use data collection forms](https://cloud.google.com/contact-center/ccai-platform/docs/use-data-collection-forms).\n* **Include conditional operators with proactive chat triggers**. When configuring proactive chat triggers, you can include OR operators with keywords and AND operators with multiple conditions. For more information, see [Proactive Web SDK Triggers](https://cloud.google.com/contact-center/ccai-platform/docs/Chat_Settings_and_Features#UUID-ff948643-7f0c-2db5-ff46-a3e121b180d4).\n* **Agents can attach files during chats**. An agent can attach a wide variety of file types using the web SDK widget during a chat session. For more information, see [Configure rich messaging and file attachments](https://cloud.google.com/contact-center/ccai-platform/docs/Chat_Settings_and_Features#rich-messaging).\n* **Disable chat audio**. An end-user can disable chat audio using the web SDK widget.\n* **System message categorization**. System messages are categorized as standard, confirmation, or error types.\n* **Post-session transfers when the end-user ends a session**. Post-session transfers can be triggered when an end-user ends a call or chat session. For more information, see [Post-session transfers](https://cloud.google.com/contact-center/ccai-platform/docs/post-session-transfer).\n\n**Documentation**\n\nHere's the web SDK v3 documentation:\n\n* [Web SDK v3 guide](https://cloud.google.com/contact-center/ccai-platform/docs/web-sdk-v3-getting-started)\n* [Web SDK v3 strings guide](https://cloud.google.com/contact-center/ccai-platform/docs/web-sdk-v3-strings)\n* [Upgrade from web SDK version 2 to web SDK version 3](https://cloud.google.com/contact-center/ccai-platform/docs/web-sdk-v3-upgrade)\n\n**Upgrade**\n\nFor help upgrading to web SDK v3, see [Upgrade from web SDK version 2 to web SDK version 3](https://cloud.google.com/contact-center/ccai-platform/docs/web-sdk-v3-upgrade). If you've been using the Private Preview version of web SDK v3, be sure to update your implementations to access `widget.js` from your Google Cloud CCaaS instance."
      }
    ],
    "2025-06-23": [
      {
        "kind": "Announcement",
        "content": "**Version 3.36 pre-release notes**\n\nHere are the pre-release notes for version 3.36. When we release version 3.36, we expect the new capabilities to be as shown here."
      },
      {
        "kind": "Feature",
        "content": "**Configure storage of Screen Share recordings**\n\nYou can now configure how long to store Screen Share recordings in your external storage settings. You can also now store Screen Share recordings that originated from the Screen Share adapter.\n\nAdministrators: The **CRM Comments Creation Details** pane at **Settings > Operation Management** has new **Post Cobrowse recording link to CRM record** settings. You need to contact Google support to enable Screen Share recordings."
      },
      {
        "kind": "Feature",
        "content": "**Restrict auto-assignment for email queues**\n\nYou can now configure email queues so that incoming emails are auto-assigned only during queue operating hours or to agents who are signed in.\n\nAdministrators: The **Auto assignment** dialog at **Settings > Queue > Email Edit/View > [queue name] > Automatic assignment > Configure** has two new checkboxes."
      },
      {
        "kind": "Feature",
        "content": "**Salesforce: New closed record options for scheduled calls**\n\nIf you've integrated Google Cloud CCaaS with the Salesforce CRM, you can configure how your instance handles scheduled calls for closed records. Here are the configuration options that are available with Salesforce integrations:\n\n* **Don't look up record status**. Your instance doesn't look up record status and makes the scheduled call regardless of whether the record is open or closed.\n* **Look up record status and reopen closed records**. Your instance looks up record status before making a scheduled call and reopens records that are closed.\n* **Look up record status and cancel scheduled calls for closed records**. Your instance looks up record status before making a scheduled call and cancels scheduled calls for records that are closed.\n\nAdministrators: The **CRM Record Creation Details** pane at **Settings > Operation Management** has new settings at **Closed record options when initiating an API-scheduled call**."
      },
      {
        "kind": "Fixed",
        "content": "The following issues were addressed in this release:\n\n* Fixed an issue where calls weren't being assigned to the correct agent in Google Cloud CCaaS reporting.\n* Fixed an issue where calls weren't being assigned to the correct agent in the CRM.\n* Fixed an issue where the communication between a virtual task assistant and an end-user was not included in the Agent Assist live transcript in the agent adapter.\n* Fixed an issue where agent outbound calls generated incorrect URLs in reporting. URLs contained `ticket` instead of `tickets`.\n* Fixed an issue where newly created global contact list destinations were not available in the **Overcapacity Deflection** settings for IVR queues.\n* Fixed an issue where the `on_email_thread_created` event listener was mistakenly logging customer names and email addresses.\n* Fixed an issue where uploading a new overcapacity deflection message didn't replace the existing message.\n* Fixed an issue where agents were not being assigned chat sessions while routing was configured for deltacast.\n* Fixed an issue where attachments were lost when: (1) A chat session was transfered to another agent, or (2) After a chat auto-dismissed, an end-user restarted the chat with the same agent in the same queue.\n* Fixed an issue where chats didn't time out after being inactive for longer than the chat timeout setting for the queue.\n* Fixed an issue where agents who were removed from a chat session using the **Connected Chats** page were not fully disconnected from the session. These agents remained in the conversation tile, couldn't remove themselves from the session, and couldn't receive new chats.\n* Fixed an issue where chats initiated outside of working hours generated incorrect chat transcripts. Instead of indicating that the support center was closed, the transcipts indicated that customer support was experiencing high volume.\n* Fixed an issue where an external agent and an end-user couldn't communicate after an internal agent did the following: (1) Answered the call, (2) Put the end-user on hold, (3) tranferred the call to a queue with auto redirect to an external number, and (4) failed to release the hold before leaving the call.\n* Fixed an issue where end-users with a blocked phone number were able to contact support using chat.\n* Fixed an issue where the global disposition list appeared in the chat adapter during wrap-up instead of the disposition list for the agent's queue.\n* Fixed an issue where a barge-in event interrupted an agent's audio.\n* Fixed an issue where call session recordings were either not being sent to external storage or they were sent in the wrong file format.\n* Fixed an issue in advanced reporting dashboards where chats appeared in the chat waiting menu even after the chat sessions ended.\n* Fixed an issue where the agent desktop translations in French (Canada) and Japanese were not complete.\n* Fixed an issue where the system was generating duplicate After Call Work records for a single wrap-up.\n* Fixed an issue where bulk upload containing new users assigned to teams failed."
      }
    ],
    "2025-06-09": [
      {
        "kind": "Announcement",
        "content": "**Salesforce ICU Update**\n\nThis is for Google Contact Center as a Service (CCaaS) customers that use Salesforce integration with CCaaS.\n\nOn **June 15th, 2025**, Salesforce is rolling out an automatic upgrade to its International Components for Unicode (ICU) locale data. This affects how date, time, number, and currency formatting are handled across Apex, Visualforce, and Lightning components.\n\nThis change affects Salesforce integrations that are using Apex API versions earlier than 45.0. These integrations use the legacy Java locale behavior, which could cause formatting discrepancies, incorrect parsing, or runtime errors.\n\n**Solution**\n\nGoogle has reviewed the CCaaS managed package and has updated the impacted classes to use safe, ICU-compatible parsing and formatting methods. This includes cleaning up legacy code that uses older API versions, which might affect this transition.\n\nThe following table shows the affected classes:\n\n**Affected classes**\n\n| Name | API version |\n| --- | --- |\n| `UJETUtilsController` | 35.0 |\n| `UJETUtilsControllerTests` | 35.0 |\n| `UJETJWT` | 43.0 |\n| `UJETJWTTests` | 43.0 |\n| `UJETPageController` | 43.0 |\n\n**Required action**\n\nTo ensure compatibility with the Salesforce ICU update and prevent any operational impact, you must complete the following action before **June 15th, 2025**:\n\n* Install the [v1.40 update](https://login.salesforce.com/?ec=302&startURL=%2Fpackaging%2FinstallPackage.apexp%3Fp0%3D04tKk0000011MNw%26InstHostname%3Dlogin.salesforce.com).\n\nThis installation updates the affected classes. No further action is required.\n\n**What happens if you don't upgrade?**\n\nIf any part of your integration or Apex code uses versions earlier than 45.0 after June 15th, Salesforce will not apply the ICU formatting to those sections. This could potentially lead to issues, including the following:\n\n* Incorrect date and time parsing\n* Unexpected errors in workflows or automations\n* Mismatch between Lightning and Classic behavior\n* Breakage in integrations expecting consistent locale handling\n\nGoogle considers the affected classes in CC\\_AGENT\\_APP v1.38 to be safe. While some of the affected classes have legacy methods that are affected by this update, they are not being actively used and will be deprecated in version 1.40. Regardless, Google still recommends installing the v1.40 update. Not upgrading can potentially impact other solutions that are installed on the environment, as described in this communication.\n\n**Defer the update**\n\nAs described in [Enable the ICU Locale Formats](https://help.salesforce.com/s/articleView?id=xcloud.icu_migration_enable.htm&type=5), you can defer the automatic rollout of this update.\n\nTo defer this update, follow these steps:\n\n1. From the Quick Find search box in **Setup**, enter **User Interface**.\n2. On the User Interface page, deselect the **Enable ICU locale formats as part of the scheduled rollout** checkbox.\n\n**Important**: This will only be effective if completed before **June 15th 2025**."
      }
    ],
    "2025-06-05": [
      {
        "kind": "Announcement",
        "content": "**Patch 3.35.15 is released**\n\nThis patch does the following:\n\n* Fixes an issue in agent desktop. When an agent had active chat sessions with two end-users simultaneously, the chat history was missing for one of the chats.\n* ~~Fixes an issue where bulk user upload jobs on the **Bulk User Management** page got stuck and didn't complete.~~\n* Fixes an issue in agent desktop where the chat adapter was unavailable when a chat was received."
      }
    ],
    "2025-05-28": [
      {
        "kind": "Announcement",
        "content": "**Headless web SDK 3.6.5 is released**\n\nThis release does the following:\n\n* Fixes an issue where duplicate messages from the virtual assistant appeared in the end-user's chat pane.\n* Fixes an issue where end-users were able to reactivate inactive chats outside of operating hours.\n* Fixes an issue with data collection forms, where the SDK timed out during the form server's first load attempt, causing a delay in the appearance of the form in the end-user's chat pane."
      }
    ],
    "2025-05-27": [
      {
        "kind": "Announcement",
        "content": "**Version 3.35 is released**\n\nAll release notes published on this date are part of version 3.35.\n\nThe timing of the update to your instance depends on the deployment schedule that you have chosen. For more information, see [Deployment schedules](https://cloud.google.com/contact-center/ccai-platform/docs/deployment-schedules)."
      },
      {
        "kind": "Feature",
        "content": "**QM integration now includes chat session events**\n\nYou can now export chat session events to an external quality management (QM) system. After you configure the endpoint of your QM system in Google Cloud CCaaS, your chat session events can be streamed to the endpoint in real time.\n\nUser experience change:\n\n* The **QM Integration** dialog at **Settings > Developer Settings > Session Data Export > QM Integration** has a new **QM Chat Events - send chat sessions events** checkbox.\n\nFor more information, see [QM, SIPREC, and WFM integration](https://cloud.google.com/contact-center/ccai-platform/docs/qm-siprec-integration)."
      },
      {
        "kind": "Feature",
        "content": "**Remove email subject lines from interaction data**\n\nWe now support removing email subject lines when you delete interaction data from your instance for specified end-users. The email subjects are removed when you delete data for an end-user in the **Consumer Privacy** dialog at **Settings > Consumer Management > Consumer Privacy**. To completely remove an end-user's data, you must also delete their emails from your mail server. You must also delete chat transcripts, call recordings, and other session-related files from your CRM or external storage, depending on your configuration.\n\nFor more information, see [Remove subject lines from end-user email interactions](https://cloud.google.com/contact-center/ccai-platform/docs/remove-end-user-data#remove-subject-lines-from-email-interactions)."
      },
      {
        "kind": "Feature",
        "content": "**New sender email with auto-response emails**\n\nYou can now configure an outbound-only email address and use it as the sender address for auto-response emails. The outbound-only address is a \"no-reply\" email address that prevents the receiver from responding.\n\nUser experience changes:\n\n* The **Auto-response** dialog at **Settings > Queue > Email > [your-email-queue] > Auto-response** has a new **Sender email** field.\n* The **Add an email** dialog at **Settings > Developer Settings > Email Account Management > Email account list > Add email account** has a new **This is an outbound only email account** checkbox.\n\nFor more information, see [Configure an outbound-only email account](https://cloud.google.com/contact-center/ccai-platform/docs/email-channel-config#configure-outbound-only-email-account) and [Configure an auto-response email](https://cloud.google.com/contact-center/ccai-platform/docs/email-channel-config#configure-auto-response-email)."
      },
      {
        "kind": "Feature",
        "content": "**Include images in outbound emails**\n\nYou can now include images in outbound emails. This includes emails from an agent in an email session and outbound auto-response emails.\n\nUser experience change:\n\n* The **Auto-response** dialog at **Settings > Queue > Email > [your-email-queue] > Auto-response** has a new **Insert Image** button.\n* The email adapter has a new **Insert Image** button.\n\nFor more information, see [Agent email adapter](https://cloud.google.com/contact-center/ccai-platform/docs/email-adapter) and [Configure an auto-response email](https://cloud.google.com/contact-center/ccai-platform/docs/email-channel-config#configure-auto-response-email)."
      },
      {
        "kind": "Fixed",
        "content": "The following issues were addressed in this release:\n\n* Fixed an issue where calls were were being logged as **Call with unknown contact** in HubSpot instead of under the correct contact name.\n* Fixed an issue where the client secret couldn't be saved when a user attempted to set up authentication (using either basic authentication or OAuth) for a custom CRM with the **Generic API** CRM lookup method.\n* Fixed an issue where the setup dialog for **Find an account by query endpoint** could not be reached due to an authentication error when configuring OAuth for a custom CRM.\n* Fixed an issue where calls were being passed to a custom CRM with the incorrect phone number format.\n* Fixed an issue for ServiceNow users where records were created for outbound calls despite the agent selecting **Do not create a record** in the call adapter.\n* Fixed an issue where a queue did not have access to the global contact list even though it was configured to have access to it.\n* Fixed an issue where the **Directory** tab didn't appear when an agent was transferring a call.\n* Fixed an issue where the **Voice Campaign** checkbox didn't appear for **Select Call Types** in the **Create Reports** pane, despite the user having the appropriate report access permissions.\n* Fixed an issue where agent extension deflection recordings didn't upload after appearing to be successfully uploaded.\n* Fixed an issue that occurred when the `@{NEXT_REOPEN_HOUR}` dynamic variable was put in the **Message** field for **After Hour Messaging** in the **Web & Mobile Messages** pane. The variable always resolved as the next time the chat queue opened on the *following* day. This happened even when the next time the chat queue opened was on the *current* day.\n* Fixed an issue that occurred when an end-user on the global contact list placed an inbound call to a queue with access to the global contact list turned off. The agent adapter displayed the destination name of the caller, despite access to the global contact list being turned off.\n* Extended the search conditions for the **Directory** tab in the agent adapter to include search by an extension number.\n* Fixed an issue where the \"next open hours\" message was incorrect when a chat ended after midnight.\n* Fixed an issue where the call transcript failed to continue after an agent returned from hold.\n* Fixed an issue where the default disposition list appeared in the agent adapter instead of the custom disposition list, which was configured to appear.\n* Fixed an issue where a user with a manager role received a \"Not Authorized\" error when attempting to use the **Operation Management** and **Disposition Codes** pages.\n* Fixed an issue where the `failReason` and `afterHours` fields in the session metadata file were incorrect for chats that failed because they were attempted after hours.\n* Fixed an issue where the **Assign agents** button wasn't working for custom after hours deflection and automatic redirection.\n* Fixed an issue where the client secret was not saved when configuring OAuth for a custom CRM.\n* Fixed an issue where calling the current queue status endpoint of the Manager API intermittently returned a 404 error.\n* Fixed an issue where the wrong disposition code list appeared for an agent after transferring a chat to an agent in a different queue.\n* Fixed an issue where chat shortcuts were not working in the agent adapter for mobile chats.\n* Fixed issues where agents were unable to successfully move beyond the wrap-up state to handle the next call."
      }
    ]
  }
}